app/views/passengers/_form.html.erb

SELECT "routes".* FROM "routes"
---

  <%= f.select :vuelo, Route.all.map{|r| [r.vuelo, r.vuelo]}%>