app/controllers/airplanes_controller.rb

INSERT INTO "airplanes" ("empresa", "piloto", "vuelo", "numero", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["empresa", "Avianca"], ["piloto", "Juan"], ["vuelo", "Bogota - New York"], ["numero", "1"], ["created_at", "2016-03-07 20:00:21.823613"], ["updated_at", "2016-03-07 20:00:21.823613"]]
---
  def create
    @airplane = Airplane.new(airplane_params)

    respond_to do |format|
      if @airplane.save

UPDATE "airplanes" SET "empresa" = ?, "updated_at" = ? WHERE "airplanes"."id" = ?  [["empresa", "Avianca"], ["updated_at", "2016-03-08 19:03:41.161169"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @airplane.update(airplane_params)

DELETE FROM "airplanes" WHERE "airplanes"."id" = ?  [["id", 1]]
---
  def destroy
    @airplane.destroy

SELECT  "airplanes".* FROM "airplanes" WHERE "airplanes"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_airplane
      @airplane = Airplane.find(params[:id])