app/controllers/passengers_controller.rb

  def index
    @passengers = Passenger.all
---
SELECT "passengers".* FROM "passengers"

def buy_ticket
    @route= Route.find(params[:route])
---
SELECT  "routes".* FROM "routes" WHERE "routes"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @passenger = Passenger.new(passenger_params)

    respond_to do |format|
      if @passenger.save
---
INSERT INTO "passengers" ("nombre", "apellido", "identificacion", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nombre", "jddf"], ["apellido", "fjd"], ["identificacion", 1236547899], ["created_at", "2016-03-08 18:48:29.961900"], ["updated_at", "2016-03-08 18:48:29.961900"]]

  def update
    respond_to do |format|
      if @passenger.update(passenger_params)
---
UPDATE "passengers" SET "nombre" = ?, "apellido" = ?, "identificacion" = ?, "vuelo" = ?, "updated_at" = ? WHERE "passengers"."id" = ?  [["nombre", "Lolita"], ["apellido", "Gomez"], ["identificacion", 1254698752], ["vuelo", "Medellin - San Andres"], ["updated_at", "2016-03-09 19:49:52.680019"], ["id", 7]]

  def destroy
    @passenger.destroy
---
DELETE FROM "passengers" WHERE "passengers"."id" = ?  [["id", 7]]

    def set_passenger
      @passenger = Passenger.find(params[:id])
---
SELECT  "passengers".* FROM "passengers" WHERE "passengers"."id" = ? LIMIT 1  [["id", 6]]