app/controllers/routes_controller.rb

INSERT INTO "routes" ("vuelo", "distancia", "hora", "codigo", "precio", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @route = Route.new(route_params)

    respond_to do |format|
      if @route.save

UPDATE "routes" SET "vuelo" = ?, "updated_at" = ? WHERE "routes"."id" = ?  [["vuelo", "Miami - Barranquilla"], ["updated_at", "2016-03-09 20:17:23.895358"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @route.update(route_params)